Revit 2027 API
ExternalServices.BuiltInExternalServices.IFCExporterService Property
 The external service which permits registration of an alternate implementation for IFC export.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId IFCExporterService { get; }
Public Shared ReadOnly Property IFCExporterService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ IFCExporterService {
	ExternalServiceId^ get ();
}
static member IFCExporterService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace